# Código Clase 6

## Biblioteca Pandas

In [ ]:
#!pip install pandas

Requirement already satisfied: pandas in c:\users\flori\appdata\local\programs\python\python312\lib\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\flori\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2.2.0)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\flori\appdata\roaming\python\python312\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\flori\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2024.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\flori\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2024.2)
Requirement already satisfied: six>=1.5 in c:\users\flori\appdata\roaming\python\python312\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

In [2]:
# Verificar la versión de pandas
import pandas as pd


print(pd.__version__)

2.2.3

## Introducción

* Ideal para trabajar con archivos tipo Excel, CSV o bases de datos.

* Facilita el trabajo con estructuras tipo tablas (Series y DataFrames).

* Se basa en NumPy pero es más flexible para análisis de datos reales.

## `Series` en Pandas

* Las Series son estructuras unidimensionales similares a arrays de NumPy, pero con un índice asociado. 
* Puede ser creado desde una lista:

In [12]:
# Creación desde una lista
s1 = pd.Series([10, 20, 30, 40, 50], index=['a', 'b', 'c', 'd', 'e'])
s1

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [13]:
data = pd.Series([0.25, 0.5, 0.75, 1.0, 1.3])
data

0    0.25
1    0.50
2    0.75
3    1.00
4    1.30
dtype: float64

* Una ``Series`` encapsula tanto una secuencia de valores como una de índices.
* Podemos acceder a ellos con los atributos `values` e `index`

In [14]:
data.values   #internamente usa array para guardar los datos

array([0.25, 0.5 , 0.75, 1.  , 1.3 ])

* Un `index` es un objeto similar a un array.

In [15]:
data.index

RangeIndex(start=0, stop=5, step=1)

In [16]:
type(data)

pandas.core.series.Series

* Podemos acceder a una `Series` a través del índice asociado de forma similar a los arrays de Numpy: con los `[]`

In [17]:
data[1]

np.float64(0.5)

In [18]:
data[2:]

2    0.75
3    1.00
4    1.30
dtype: float64

* Pueden ser `strings`

In [19]:
data = pd.Series([0.25, 0.5, 0.75, 1.0],
                 index=['a', 'b', 'c', 'd'], name='proporciones', dtype='float64')
data

a    0.25
b    0.50
c    0.75
d    1.00
Name: proporciones, dtype: float64

In [20]:
data.index

Index(['a', 'b', 'c', 'd'], dtype='object')

* Y podemos acceder simplemente:

In [24]:
valor= data['c']
print(valor)

0.75

### ``Series`` como un `dict` especializado

* Un `dict` es una estructura que mapea un set de keys arbitrarias a un set de valores de un tipo.
* Puede hacerse, entonces, una analogía entre una `Series` y un `dict`

In [25]:
population_dict = {'California': 38332521,
                   'Texas': 26448193,
                   'New York': 19651127,
                   'Florida': 19552860,
                   'Illinois': 12882135}

population = pd.Series(population_dict)
population

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

In [26]:
population.values

array([38332521, 26448193, 19651127, 19552860, 12882135])

In [27]:
population.index

Index(['California', 'Texas', 'New York', 'Florida', 'Illinois'], dtype='object')

* Puede crearse una `Series` a partir de un `dict`: el índice se toma de las keys.
* Así, puede accederse de forma análoga a un `dict`.

In [29]:
pop=population['California']
print(pop)

38332521

* A diferencia de un `dict` una `Series` soporta algunas operaciones del estilo de un array, como por ejemplo, slicing:

In [14]:
population['Texas':'New York']

Texas       26448193
New York    19651127
dtype: int64

## Objeto `DataFrame`

* Otra estructura fundamental. 
* 2D, filas y columnas, representa una tabla. 
* Vamos a verlo armandolo nosotros, o trayendonos los datos desde un archivo (csv, xls, json)

### Construyendo objetos `DataFrame`

In [30]:
# Creación desde un diccionario de listas
data = {
    'Nombre': ['Juan', 'Ana', 'Carlos', 'María', 'Pedro'],
    'Edad': [28, 34, 29, 42, 31],
    'Ciudad': ['Madrid', 'Barcelona', 'Valencia', 'Sevilla', 'Bilbao'],
    'Puntuación': [8.5, 9.0, 7.5, 8.0, 9.5]
}

In [32]:
type(data)

dict

In [34]:
df1= pd.DataFrame(data)
df1

   Nombre  Edad     Ciudad  Puntuación
0    Juan    28     Madrid         8.5
1     Ana    34  Barcelona         9.0
2  Carlos    29   Valencia         7.5
3   María    42    Sevilla         8.0
4   Pedro    31     Bilbao         9.5

In [35]:
# Creación desde una lista de diccionarios
personas = [
    {'Nombre': 'Juan', 'Edad': 28, 'Ciudad': 'Madrid'},
    {'Nombre': 'Ana', 'Edad': 34, 'Ciudad': 'Barcelona'},
    {'Nombre': 'Carlos', 'Edad': 29, 'Ciudad': 'Valencia'}
]

df = pd.DataFrame(personas)
print("DataFrame desde lista de diccionarios:")
print(df)
df

DataFrame desde lista de diccionarios:
   Nombre  Edad     Ciudad
0    Juan    28     Madrid
1     Ana    34  Barcelona
2  Carlos    29   Valencia

   Nombre  Edad     Ciudad
0    Juan    28     Madrid
1     Ana    34  Barcelona
2  Carlos    29   Valencia

In [38]:
df1= pd.DataFrame(data)
df1

   Nombre  Edad     Ciudad  Puntuación
0    Juan    28     Madrid         8.5
1     Ana    34  Barcelona         9.0
2  Carlos    29   Valencia         7.5
3   María    42    Sevilla         8.0
4   Pedro    31     Bilbao         9.5

In [45]:
df1.tail()

   Nombre  Edad     Ciudad  Puntuación
0    Juan    28     Madrid         8.5
1     Ana    34  Barcelona         9.0
2  Carlos    29   Valencia         7.5
3   María    42    Sevilla         8.0
4   Pedro    31     Bilbao         9.5

In [ ]:
# Información general
df.info()  # Muestra información sobre el DataFrame, como columnas, tipos de datos y valores no nulos.   dtypes
df.describe()  # Estadísticas descriptivas para columnas numéricas.
df.shape  # Dimensiones del DataFrame (filas, columnas).
df.columns  # Nombres de las columnas.
df.index  # Índices del DataFrame.

# Selección y acceso
df.head(n)  # Muestra las primeras 'n' filas (por defecto 5).
df.tail(n)  # Muestra las últimas 'n' filas (por defecto 5).
df['columna']  # Acceso a una columna.
df[['columna1', 'columna2']]  # Acceso a múltiples columnas.
df.loc[fila, columna]  # Selección por etiquetas.
df.iloc[fila, columna]  # Selección por posición/indices

In [51]:
dfnombre=df1[['Nombre', 'Edad']]  
dfnombre

   Nombre  Edad
0    Juan    28
1     Ana    34
2  Carlos    29
3   María    42
4   Pedro    31

In [52]:
df.iloc[1,0]

'Ana'

In [53]:
df.loc[0, 'Nombre']

'Juan'

Funciones basicas de pandas

In [ ]:
# Operaciones básicas
df.sort_values(by='columna', ascending=True)  # Ordenar por una columna.
df.drop('columna', axis=1)  # Eliminar una columna.
df.drop(index, axis=0)  # Eliminar una fila.
df['nueva_columna'] = valores  # Crear o modificar una columna.
df.isnull()  # Identificar valores nulos.
df.fillna(valor)  # Rellenar valores nulos.
df.dropna()  # Eliminar filas con valores nulos.

# Estadísticas
df['columna'].unique()  # Valores únicos en una columna.
df['columna'].value_counts()  # Conteo de valores únicos.
df.corr()  # Correlación entre columnas numéricas.

Otro ejemplo desde un diccionario de listas

In [11]:
datos = {
    'cliente': ['Ana', 'Luis', 'Carla', 'Pedro', 'Lucía', 'Luis', 'Pedro'],
    'edad': [25, 40, 35, 50, 28, 40, 40],
    'saldo': [10000, 50000, 30000, None, 15000, 50000, 100000],
    'creditos': [1, 2, 1, 3, 2, 2, 3]
}

df2 = pd.DataFrame(datos)
df2

  cliente  edad     saldo  creditos
0     Ana    25   10000.0         1
1    Luis    40   50000.0         2
2   Carla    35   30000.0         1
3   Pedro    50       NaN         3
4   Lucía    28   15000.0         2
5    Luis    40   50000.0         2
6   Pedro    40  100000.0         3

In [12]:
# Ordenar por saldo
df2.sort_values(by=['edad','saldo'], ascending=[True,False])

  cliente  edad     saldo  creditos
0     Ana    25   10000.0         1
4   Lucía    28   15000.0         2
2   Carla    35   30000.0         1
6   Pedro    40  100000.0         3
1    Luis    40   50000.0         2
5    Luis    40   50000.0         2
3   Pedro    50       NaN         3

In [13]:
# Eliminar la columna 'creditos'
df2.drop('creditos', axis=1) ##inplace=True)

  cliente  edad     saldo
0     Ana    25   10000.0
1    Luis    40   50000.0
2   Carla    35   30000.0
3   Pedro    50       NaN
4   Lucía    28   15000.0
5    Luis    40   50000.0
6   Pedro    40  100000.0

In [14]:
df2

  cliente  edad     saldo  creditos
0     Ana    25   10000.0         1
1    Luis    40   50000.0         2
2   Carla    35   30000.0         1
3   Pedro    50       NaN         3
4   Lucía    28   15000.0         2
5    Luis    40   50000.0         2
6   Pedro    40  100000.0         3

In [15]:
# Eliminar la fila con índice 3
df2.drop(3, axis=0)

  cliente  edad     saldo  creditos
0     Ana    25   10000.0         1
1    Luis    40   50000.0         2
2   Carla    35   30000.0         1
4   Lucía    28   15000.0         2
5    Luis    40   50000.0         2
6   Pedro    40  100000.0         3

In [16]:
# Crear nueva columna "saldo_promedio" como saldo dividido por edad
df2['saldo_promedio'] = df2['saldo'] / df2['edad']

In [17]:
df2

  cliente  edad     saldo  creditos  saldo_promedio
0     Ana    25   10000.0         1      400.000000
1    Luis    40   50000.0         2     1250.000000
2   Carla    35   30000.0         1      857.142857
3   Pedro    50       NaN         3             NaN
4   Lucía    28   15000.0         2      535.714286
5    Luis    40   50000.0         2     1250.000000
6   Pedro    40  100000.0         3     2500.000000

In [18]:
# Identificar valores nulos
df2.isnull() #.sum()

   cliente   edad  saldo  creditos  saldo_promedio
0    False  False  False     False           False
1    False  False  False     False           False
2    False  False  False     False           False
3    False  False   True     False            True
4    False  False  False     False           False
5    False  False  False     False           False
6    False  False  False     False           False

In [19]:
df2.describe() #

            edad          saldo  creditos  saldo_promedio
count   7.000000       6.000000  7.000000        6.000000
mean   36.857143   42500.000000  2.000000     1132.142857
std     8.414839   32825.295124  0.816497      757.126011
min    25.000000   10000.000000  1.000000      400.000000
25%    31.500000   18750.000000  1.500000      616.071429
50%    40.000000   40000.000000  2.000000     1053.571429
75%    40.000000   50000.000000  2.500000     1250.000000
max    50.000000  100000.000000  3.000000     2500.000000

In [20]:
# Rellenar nulos con 0
df2.fillna(0)

  cliente  edad     saldo  creditos  saldo_promedio
0     Ana    25   10000.0         1      400.000000
1    Luis    40   50000.0         2     1250.000000
2   Carla    35   30000.0         1      857.142857
3   Pedro    50       0.0         3        0.000000
4   Lucía    28   15000.0         2      535.714286
5    Luis    40   50000.0         2     1250.000000
6   Pedro    40  100000.0         3     2500.000000

In [21]:
# Eliminar filas con nulos
df2.dropna()   #inplace=True

  cliente  edad     saldo  creditos  saldo_promedio
0     Ana    25   10000.0         1      400.000000
1    Luis    40   50000.0         2     1250.000000
2   Carla    35   30000.0         1      857.142857
4   Lucía    28   15000.0         2      535.714286
5    Luis    40   50000.0         2     1250.000000
6   Pedro    40  100000.0         3     2500.000000

In [22]:
df2

  cliente  edad     saldo  creditos  saldo_promedio
0     Ana    25   10000.0         1      400.000000
1    Luis    40   50000.0         2     1250.000000
2   Carla    35   30000.0         1      857.142857
3   Pedro    50       NaN         3             NaN
4   Lucía    28   15000.0         2      535.714286
5    Luis    40   50000.0         2     1250.000000
6   Pedro    40  100000.0         3     2500.000000

In [60]:
df2.dtypes

cliente            object
edad                int64
saldo             float64
creditos            int64
saldo_promedio    float64
dtype: object

In [61]:
df2['cliente'].unique()         # Nombres únicos

array(['Ana', 'Luis', 'Carla', 'Pedro', 'Lucía'], dtype=object)

In [80]:
df2['cliente'].value_counts()

cliente
Luis     2
Ana      1
Carla    1
Pedro    1
Lucía    1
Name: count, dtype: int64

In [ ]:
# Ver filas duplicadas completas
df2.duplicated()        #.sum() cuantos hay

np.int64(1)

In [86]:
# Ver solo las filas duplicadas
df2[df2.duplicated()]

  cliente  edad    saldo  creditos  saldo_promedio
5    Luis    40  50000.0         2          1250.0

In [62]:
df2.drop_duplicates(inplace=True) #elimina cuando toda la fila esta duplicada     #### df.drop_duplicates(subset=['cliente'])

In [63]:
filtro1=df2[df2['edad'] > 30]  # Filtrar filas donde la edad es mayor a 30
filtro1

  cliente  edad     saldo  creditos  saldo_promedio
1    Luis    40   50000.0         2     1250.000000
2   Carla    35   30000.0         1      857.142857
3   Pedro    50       NaN         3             NaN
6   Pedro    40  100000.0         3     2500.000000

In [67]:
df2.cliente.isin(filtro1.cliente)

0    False
1     True
2     True
3     True
4    False
6     True
Name: cliente, dtype: bool

In [68]:
df2[df2.cliente.isin(filtro1.cliente)]

  cliente  edad     saldo  creditos  saldo_promedio
1    Luis    40   50000.0         2     1250.000000
2   Carla    35   30000.0         1      857.142857
3   Pedro    50       NaN         3             NaN
6   Pedro    40  100000.0         3     2500.000000

In [ ]:
filtro2=df2[(df2['edad'] > 30) & (df2['creditos']==2)]  # Filtrar filas donde la edad es mayor a 30 y los creditos son 2
filtro2

  cliente  edad    saldo  creditos  saldo_promedio
1    Luis    40  50000.0         2          1250.0
5    Luis    40  50000.0         2          1250.0

In [121]:
# Renombrar columnas
renombrar = df2.rename(columns={'saldo_promedio': 'saldo_prom', 'edad': 'años'})
renombrar

  cliente  años    saldo  creditos   saldo_prom
0     Ana    25  10000.0         1   400.000000
1    Luis    40  50000.0         2  1250.000000
2   Carla    35  30000.0         1   857.142857
3   Pedro    50      NaN         3          NaN
4   Lucía    28  15000.0         2   535.714286
5    Luis    40  50000.0         2  1250.000000

In [122]:
# Reordenar columnas
df_reordered = df2[['saldo', 'edad', 'cliente', 'creditos', 'saldo_promedio']]
df_reordered

     saldo  edad cliente  creditos  saldo_promedio
0  10000.0    25     Ana         1      400.000000
1  50000.0    40    Luis         2     1250.000000
2  30000.0    35   Carla         1      857.142857
3      NaN    50   Pedro         3             NaN
4  15000.0    28   Lucía         2      535.714286
5  50000.0    40    Luis         2     1250.000000

In [69]:
df2

  cliente  edad     saldo  creditos  saldo_promedio
0     Ana    25   10000.0         1      400.000000
1    Luis    40   50000.0         2     1250.000000
2   Carla    35   30000.0         1      857.142857
3   Pedro    50       NaN         3             NaN
4   Lucía    28   15000.0         2      535.714286
6   Pedro    40  100000.0         3     2500.000000

In [70]:
df3=df2

In [73]:
df3.dropna(inplace=True)

In [74]:
df3

  cliente  edad     saldo  creditos  saldo_promedio
0     Ana    25   10000.0         1      400.000000
1    Luis    40   50000.0         2     1250.000000
2   Carla    35   30000.0         1      857.142857
4   Lucía    28   15000.0         2      535.714286
6   Pedro    40  100000.0         3     2500.000000

In [125]:
dfnuevo=df2[['cliente','saldo']].copy()
dfnuevo

  cliente    saldo
0     Ana  10000.0
1    Luis  50000.0
2   Carla  30000.0
3   Pedro      NaN
4   Lucía  15000.0
5    Luis  50000.0

In [75]:
import copy

In [76]:
copy.deepcopy(df2)

  cliente  edad     saldo  creditos  saldo_promedio
0     Ana    25   10000.0         1      400.000000
1    Luis    40   50000.0         2     1250.000000
2   Carla    35   30000.0         1      857.142857
4   Lucía    28   15000.0         2      535.714286
6   Pedro    40  100000.0         3     2500.000000

DataFrames

### Cargando datos

In [ ]:
##paso 1 importacion 
#CSV
clientes= pd.read_csv('clientes_banco.csv')  #, sep=',', encoding='latin1', header=0, index_col=None)
                                            # Opciones comunes de read_csv
                                            # pd.read_csv('archivo.csv', sep=';')  # Cambiar separador  tab sep='\t'
                                            # pd.read_csv('archivo.csv', header=None)  # Sin encabezados
                                            # pd.read_csv('archivo.csv', usecols=['col1', 'col3'])  # Solo ciertas columnas
                                            # pd.read_csv('archivo.csv', nrows=100)  # Limitar número de filas

In [79]:
clientes.head(10)

,ID_cliente,Nombre,Apellido,Edad,Provincia,Ocupacion,Saldo_cuenta,Limite_credito,Tiene_tarjeta,Producto_principal,Fecha_alta,Nivel_satisfaccion
0,1,Diego,Fernández,67,Tucumán,Desempleado,NaN,123027.71,True,Tarjeta de crédito,2017-01-23,6.0
1,2,Lucía,García,77,Santa Fe,Empresario,112856.92,182542.98,True,Caja de ahorro,2017-01-16,8.0
2,3,Ana,Sánchez,60,Salta,Desempleado,175554.01,NaN,True,Plazo fijo,2016-11-18,5.0
3,4,Carlos,Díaz,54,Santa Fe,Empleado,-6681.79,142505.72,False,Cuenta corriente,2016-12-23,2.0
4,5,Diego,Gómez,32,Salta,NaN,22934.41,171855.97,False,Caja de ahorro,2019-04-16,4.0
5,6,Marta,Sánchez,45,Salta,Jubilado,133780.50,123626.87,False,Tarjeta de crédito,2017-01-16,NaN
6,7,Pedro,Romero,35,Mendoza,Desempleado,168198.39,191757.87,True,Tarjeta de crédito,2015-08-30,NaN
7,8,Diego,Rodríguez,51,Buenos Aires,Desempleado,75505.36,149290.36,False,Caja de ahorro,2022-06-05,6.0
8,8,Diego,Rodríguez,51,Buenos Aires,Desempleado,75505.36,149290.36,False,Caja de ahorro,2022-06-05,6.0
9,8,Diego,Rodríguez,51,Buenos Aires,Desempleado,75505.36,149290.36,False,Caja de ahorro,2022-06-05,6.0

In [ ]:
#pd.set_option('display.max_columns', None)
#pd.set_option('display.max_rows', None)

In [80]:
clientesxls=pd.read_excel('clientes_banco.xlsx')  #, sheet_name='nombre') #openpyxl

In [81]:
clientesxls.head()

,ID_cliente,Nombre,Apellido,Edad,Provincia,Ocupación,Saldo_cuenta,Limite_credito,Tiene_tarjeta,Producto_principal,Fecha_alta,Nivel_satisfacción
0,1,Diego,Fernández,67,Tucumán,Desempleado,NaN,123027.71,True,Tarjeta de crédito,2017-01-23,6.0
1,2,Lucía,García,77,Santa Fe,Empresario,112856.92,182542.98,True,Caja de ahorro,2017-01-16,8.0
2,3,Ana,Sánchez,60,Salta,Desempleado,175554.01,NaN,True,Plazo fijo,2016-11-18,5.0
3,4,Carlos,Díaz,54,Santa Fe,Empleado,-6681.79,142505.72,False,Cuenta corriente,2016-12-23,2.0
4,5,Diego,Gómez,32,Salta,NaN,22934.41,171855.97,False,Caja de ahorro,2019-04-16,4.0

In [82]:
clientesjson=pd.read_json('clientes_banco.json', lines=True)  # Use lines=True for newline-delimited JSON

In [29]:
clientesjson.head()

,ID_cliente,Nombre,Apellido,Edad,Provincia,Ocupación,Saldo_cuenta,Limite_credito,Tiene_tarjeta,Producto_principal,Fecha_alta,Nivel_satisfacción
0,1,Diego,Fernández,67,Tucumán,Desempleado,NaN,123027.71,True,Tarjeta de crédito,1485129600000,6.0
1,2,Lucía,García,77,Santa Fe,Empresario,112856.92,182542.98,True,Caja de ahorro,1484524800000,8.0
2,3,Ana,Sánchez,60,Salta,Desempleado,175554.01,NaN,True,Plazo fijo,1479427200000,5.0
3,4,Carlos,Díaz,54,Santa Fe,Empleado,-6681.79,142505.72,False,Cuenta corriente,1482451200000,2.0
4,5,Diego,Gómez,32,Salta,None,22934.41,171855.97,False,Caja de ahorro,1555372800000,4.0

In [ ]:

# Nota: También puede importar desde:
# - SQL: pd.read_sql()
# - HTML: pd.read_html()
# - Clipboard: pd.read_clipboard()

# url = 'https://example.com/data.csv'
# df_url = pd.read_csv(url)
# df_url.head()                                                         ctrl+k+c

## Análisis descriptivo en Pandas
### Ejemplo clientes. Ejercicio practico.


¿Que tipos de datos tiene el DF? ¿Cuántos registros y columnas hay?

¿Qué tipo de datos hay en cada columna? ¿Hay nulos, duplicados? ¿Como los manejo?

In [30]:
clientes.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2002 entries, 0 to 2001
Data columns (total 12 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   ID_cliente          2002 non-null   int64
 1   Nombre              2002 non-null   object
 2   Apellido            2002 non-null   object
 3   Edad                2002 non-null   int64
 4   Provincia           2002 non-null   object
 5   Ocupacion           1802 non-null   object
 6   Saldo_cuenta        1802 non-null   float64
 7   Limite_credito      1802 non-null   float64
 8   Tiene_tarjeta       2002 non-null   bool
 9   Producto_principal  2002 non-null   object
 10  Fecha_alta          2002 non-null   object
 11  Nivel_satisfaccion  1802 non-null   float64
dtypes: bool(1), float64(3), int64(2), object(6)
memory usage: 174.1+ KB

In [32]:
clientes.shape

(2002, 12)

In [33]:
clientes.columns

Index(['ID_cliente', 'Nombre', 'Apellido', 'Edad', 'Provincia', 'Ocupacion',
       'Saldo_cuenta', 'Limite_credito', 'Tiene_tarjeta', 'Producto_principal',
       'Fecha_alta', 'Nivel_satisfaccion'],
      dtype='object')

In [34]:
clientes.head(20)

,ID_cliente,Nombre,Apellido,Edad,Provincia,Ocupacion,Saldo_cuenta,Limite_credito,Tiene_tarjeta,Producto_principal,Fecha_alta,Nivel_satisfaccion
0,1,Diego,Fernández,67,Tucumán,Desempleado,NaN,123027.71,True,Tarjeta de crédito,2017-01-23,6.0
1,2,Lucía,García,77,Santa Fe,Empresario,112856.92,182542.98,True,Caja de ahorro,2017-01-16,8.0
2,3,Ana,Sánchez,60,Salta,Desempleado,175554.01,NaN,True,Plazo fijo,2016-11-18,5.0
3,4,Carlos,Díaz,54,Santa Fe,Empleado,-6681.79,142505.72,False,Cuenta corriente,2016-12-23,2.0
4,5,Diego,Gómez,32,Salta,NaN,22934.41,171855.97,False,Caja de ahorro,2019-04-16,4.0
5,6,Marta,Sánchez,45,Salta,Jubilado,133780.50,123626.87,False,Tarjeta de crédito,2017-01-16,NaN
6,7,Pedro,Romero,35,Mendoza,Desempleado,168198.39,191757.87,True,Tarjeta de crédito,2015-08-30,NaN
7,8,Diego,Rodríguez,51,Buenos Aires,Desempleado,75505.36,149290.36,False,Caja de ahorro,2022-06-05,6.0
8,8,Diego,Rodríguez,51,Buenos Aires,Desempleado,75505.36,149290.36,False,Caja de ahorro,2022-06-05,6.0
9,8,Diego,Rodríguez,51,Buenos Aires,Desempleado,75505.36,149290.36,False,Caja de ahorro,2022-06-05,6.0
10,9,Ana,López,39,Tucumán,Empresario,87.97,89675.23,False,Tarjeta de crédito,2016-12-08,2.0
11,10,Carlos,Fernández,28,Mendoza,Estudiante,171596.21,123199.89,False,Cuenta corriente,2016-03-10,6.0
12,11,Lucía,García,75,Mendoza,Estudiante,59446.74,202327.42,True,Cuenta corriente,2017-02-19,1.0
13,12,Ana,Fernández,74,Neuquén,Empresario,81937.68,112519.90,False,Tarjeta de crédito,2016-04-28,NaN
14,13,Ana,Sánchez,30,Salta,Estudiante,115952.24,185763.10,False,Tarjeta de crédito,2021-08-28,3.0
15,14,Pedro,López,21,Salta,Empleado,NaN,154866.94,True,Cuenta corriente,2019-03-14,9.0
16,15,Sofía,Romero,39,Tucumán,Estudiante,56193.51,143131.99,True,Tarjeta de crédito,2015-06-19,2.0
17,16,Carlos,Martínez,24,Santa Fe,Empresario,57109.99,250503.77,True,Préstamo personal,2017-10-17,8.0
18,17,María,Gómez,78,Santa Fe,Estudiante,192896.43,98631.35,True,Plazo fijo,2023-03-17,6.0
19,18,Ana,López,60,Chubut,Jubilado,157980.68,120394.66,True,Préstamo personal,2017-05-18,6.0

In [35]:
clientes.tail(4)

,ID_cliente,Nombre,Apellido,Edad,Provincia,Ocupacion,Saldo_cuenta,Limite_credito,Tiene_tarjeta,Producto_principal,Fecha_alta,Nivel_satisfaccion
1998,1997,Diego,García,21,Chubut,Estudiante,156444.58,219933.48,True,Cuenta corriente,2020-08-21,2.0
1999,1998,Carlos,Fernández,68,Buenos Aires,Estudiante,173200.68,71142.03,False,Tarjeta de crédito,2018-04-29,1.0
2000,1999,María,Romero,71,Chubut,Desempleado,101537.86,128138.04,True,Plazo fijo,2018-11-24,3.0
2001,2000,Pedro,López,36,Salta,Empresario,81985.54,174885.53,True,Caja de ahorro,2019-04-10,8.0

In [83]:
# Verificar valores nulos en cada columna
clientes.isnull().sum()

ID_cliente              0
Nombre                  0
Apellido                0
Edad                    0
Provincia               0
Ocupacion             200
Saldo_cuenta          200
Limite_credito        200
Tiene_tarjeta           0
Producto_principal      0
Fecha_alta              0
Nivel_satisfaccion    200
dtype: int64

In [84]:
clientes.fillna(0, inplace=True)  # con 0  o # Eliminar filas con nulos df.dropna()

In [38]:
# Verificar valores únicos en cada columna
clientes.nunique()

ID_cliente            2000
Nombre                  10
Apellido                10
Edad                    62
Provincia                8
Ocupacion                6
Saldo_cuenta          1801
Limite_credito        1801
Tiene_tarjeta            2
Producto_principal       5
Fecha_alta            1454
Nivel_satisfaccion      11
dtype: int64

In [39]:
# Verificar duplicados
clientes.duplicated().sum()

np.int64(2)

In [40]:
clientes[clientes.duplicated()]

,ID_cliente,Nombre,Apellido,Edad,Provincia,Ocupacion,Saldo_cuenta,Limite_credito,Tiene_tarjeta,Producto_principal,Fecha_alta,Nivel_satisfaccion
8,8,Diego,Rodríguez,51,Buenos Aires,Desempleado,75505.36,149290.36,False,Caja de ahorro,2022-06-05,6.0
9,8,Diego,Rodríguez,51,Buenos Aires,Desempleado,75505.36,149290.36,False,Caja de ahorro,2022-06-05,6.0

In [41]:
clientes.drop_duplicates(inplace=True)  # Eliminar duplicados

¿Cuál es el rango de edades de los clientes?

In [42]:
edad_min = clientes['Edad'].min()
edad_max = clientes['Edad'].max()
print(f"Los clientes tienen entre {edad_min} y {edad_max} años.")

Los clientes tienen entre 18 y 79 años.

¿Cuántos clientes están desempleados?

In [43]:
desempleados = clientes[clientes['Ocupacion'] == 'Desempleado']
print(f"Hay {desempleados.shape[0]} clientes desempleados.")

Hay 355 clientes desempleados.

¿Cuales son los clientes menores de 21 años?

In [90]:
menoresde21= clientes[clientes['Edad'] < 21]
menoresde21.head(20)

,ID_cliente,Nombre,Apellido,Edad,Provincia,Ocupacion,Saldo_cuenta,Limite_credito,Tiene_tarjeta,Producto_principal,Fecha_alta,Nivel_satisfaccion
25,24,Sofía,Díaz,18,Santa Fe,Desempleado,112935.51,164345.14,True,Cuenta corriente,2015-02-01,4.0
27,26,Juan,López,20,Neuquén,Empleado,128468.30,177812.90,True,Plazo fijo,2023-02-12,7.0
32,31,Luis,Romero,18,Mendoza,Empleado,162714.24,206084.87,False,Plazo fijo,2022-03-29,4.0
45,44,Luis,García,20,Córdoba,Desempleado,64139.37,180666.15,False,Caja de ahorro,2021-03-07,7.0
53,52,Juan,Fernández,18,Tucumán,Desempleado,76249.84,225221.39,False,Préstamo personal,2022-03-27,2.0
103,102,Juan,Pérez,20,Córdoba,Jubilado,162489.14,98645.44,True,Cuenta corriente,2019-12-22,0.0
124,123,Pedro,Martínez,19,Tucumán,Jubilado,69125.64,136552.31,False,Cuenta corriente,2022-05-01,2.0
172,171,Pedro,Rodríguez,20,Buenos Aires,Desempleado,89410.82,96251.90,True,Tarjeta de crédito,2016-04-04,6.0
177,176,Juan,Rodríguez,18,Mendoza,Estudiante,133290.42,149575.36,True,Caja de ahorro,2019-03-14,6.0
184,183,Juan,Gómez,18,Buenos Aires,Jubilado,42731.52,121241.83,True,Tarjeta de crédito,2021-03-10,9.0
204,203,Luis,Martínez,20,Córdoba,Empresario,108280.48,152270.00,True,Plazo fijo,2021-11-28,2.0
210,209,Marta,Fernández,18,Neuquén,Estudiante,92126.51,181039.79,False,Tarjeta de crédito,2017-09-19,5.0
218,217,Ana,Martínez,20,Chubut,Desempleado,208685.51,0.00,True,Caja de ahorro,2018-02-14,1.0
233,232,Juan,López,18,Mendoza,Estudiante,24415.09,191099.83,False,Cuenta corriente,2019-06-16,2.0
249,248,Ana,Gómez,19,Mendoza,Desempleado,1311.75,129393.99,False,Préstamo personal,2016-08-07,2.0
253,252,Lucía,Pérez,20,Santa Fe,Estudiante,91107.71,0.00,True,Tarjeta de crédito,2016-07-13,6.0
263,262,María,Gómez,19,Córdoba,Estudiante,169350.37,139935.70,True,Préstamo personal,2018-07-15,9.0
280,279,Sofía,Gómez,19,Neuquén,Estudiante,172705.99,226086.39,False,Caja de ahorro,2015-07-09,3.0
290,289,Juan,Rodríguez,20,Santa Fe,Empresario,113405.00,214139.20,True,Tarjeta de crédito,2020-02-23,4.0
292,291,Carlos,Fernández,20,Mendoza,Estudiante,157334.12,204087.49,True,Tarjeta de crédito,2016-08-19,2.0

In [88]:
pd.set_option('display.max_rows', 500)

In [92]:
menoresde21.sample(5)

,ID_cliente,Nombre,Apellido,Edad,Provincia,Ocupacion,Saldo_cuenta,Limite_credito,Tiene_tarjeta,Producto_principal,Fecha_alta,Nivel_satisfaccion
1363,1362,Pedro,García,18,Neuquén,Desempleado,59636.39,195514.47,True,Tarjeta de crédito,2020-07-17,2.0
1226,1225,Carlos,Rodríguez,19,Salta,Empleado,130904.40,0.00,False,Préstamo personal,2015-05-19,4.0
1834,1833,Luis,López,19,Santa Fe,Empresario,177755.78,117836.46,True,Tarjeta de crédito,2023-01-06,8.0
379,378,María,Romero,19,Chubut,Jubilado,93546.95,181615.74,True,Cuenta corriente,2020-10-10,0.0
883,882,Sofía,Sánchez,20,Salta,Empleado,78791.90,103466.41,False,Préstamo personal,2019-07-17,9.0

In [93]:
menoresde21.sample(frac=0.1)

,ID_cliente,Nombre,Apellido,Edad,Provincia,Ocupacion,Saldo_cuenta,Limite_credito,Tiene_tarjeta,Producto_principal,Fecha_alta,Nivel_satisfaccion
404,403,Diego,Fernández,20,Santa Fe,Empleado,91451.44,79499.08,True,Préstamo personal,2022-03-06,10.0
1807,1806,Lucía,Pérez,19,Buenos Aires,Empresario,91977.55,118847.81,False,Caja de ahorro,2022-10-25,9.0
754,753,Marta,Sánchez,19,Salta,Desempleado,58739.27,111461.41,False,Plazo fijo,2019-09-18,10.0
1266,1265,Luis,Fernández,18,Neuquén,0,74835.11,100209.94,False,Tarjeta de crédito,2019-02-07,4.0
32,31,Luis,Romero,18,Mendoza,Empleado,162714.24,206084.87,False,Plazo fijo,2022-03-29,4.0
629,628,Pedro,López,19,Tucumán,Empleado,150932.84,140702.46,False,Préstamo personal,2019-11-08,10.0
1111,1110,María,Rodríguez,20,Buenos Aires,Desempleado,41944.38,213383.41,True,Plazo fijo,2016-01-22,1.0
103,102,Juan,Pérez,20,Córdoba,Jubilado,162489.14,98645.44,True,Cuenta corriente,2019-12-22,0.0
1971,1970,Marta,Rodríguez,18,Buenos Aires,Empleado,57016.04,128447.39,False,Tarjeta de crédito,2020-11-04,6.0
124,123,Pedro,Martínez,19,Tucumán,Jubilado,69125.64,136552.31,False,Cuenta corriente,2022-05-01,2.0

In [87]:
menoresde21.tail()

,ID_cliente,Nombre,Apellido,Edad,Provincia,Ocupacion,Saldo_cuenta,Limite_credito,Tiene_tarjeta,Producto_principal,Fecha_alta,Nivel_satisfaccion
1970,1969,Diego,García,20,Mendoza,Jubilado,55609.52,97788.30,True,Caja de ahorro,2015-03-22,5.0
1971,1970,Marta,Rodríguez,18,Buenos Aires,Empleado,57016.04,128447.39,False,Tarjeta de crédito,2020-11-04,6.0
1975,1974,Lucía,Fernández,18,Mendoza,Empleado,73653.75,131878.01,True,Préstamo personal,2015-07-04,6.0
1977,1976,Juan,Gómez,19,Mendoza,Empleado,133817.71,199459.50,False,Préstamo personal,2022-07-08,6.0
1986,1985,Carlos,Díaz,20,Córdoba,Jubilado,165438.92,157959.78,True,Caja de ahorro,2018-08-01,2.0

In [85]:
# si quisiera guardar el resultado en un csv
menoresde21.to_csv('menores.csv', index=False)  # Guardar en CSV sin índice

In [46]:
menores4col= menoresde21[['Nombre','Apellido', 'Edad', 'Provincia']].copy()
menores4col

      Nombre   Apellido  Edad     Provincia
25     Sofía       Díaz    18      Santa Fe
27      Juan      López    20       Neuquén
32      Luis     Romero    18       Mendoza
45      Luis     García    20       Córdoba
53      Juan  Fernández    18       Tucumán
...      ...        ...   ...           ...
1970   Diego     García    20       Mendoza
1971   Marta  Rodríguez    18  Buenos Aires
1975   Lucía  Fernández    18       Mendoza
1977    Juan      Gómez    19       Mendoza
1986  Carlos       Díaz    20       Córdoba

[96 rows x 4 columns]

Creo una nueva columna con el nombre completo

In [47]:
clientes['Nombre_Completo'] = clientes['Nombre'] + ' ' + clientes['Apellido']
clientes.head()

,ID_cliente,Nombre,Apellido,Edad,Provincia,Ocupacion,Saldo_cuenta,Limite_credito,Tiene_tarjeta,Producto_principal,Fecha_alta,Nivel_satisfaccion,Nombre_Completo
0,1,Diego,Fernández,67,Tucumán,Desempleado,0.00,123027.71,True,Tarjeta de crédito,2017-01-23,6.0,Diego Fernández
1,2,Lucía,García,77,Santa Fe,Empresario,112856.92,182542.98,True,Caja de ahorro,2017-01-16,8.0,Lucía García
2,3,Ana,Sánchez,60,Salta,Desempleado,175554.01,0.00,True,Plazo fijo,2016-11-18,5.0,Ana Sánchez
3,4,Carlos,Díaz,54,Santa Fe,Empleado,-6681.79,142505.72,False,Cuenta corriente,2016-12-23,2.0,Carlos Díaz
4,5,Diego,Gómez,32,Salta,0,22934.41,171855.97,False,Caja de ahorro,2019-04-16,4.0,Diego Gómez

In [ ]:
#clientes.drop(['Nombre', 'Apellido'], axis=1, inplace=True)

¿De qué provincias son los clientes? ¿Cuántos hay por provincia?

In [94]:
provincias = clientes['Provincia'].value_counts()
print(provincias)

Provincia
Córdoba         279
Neuquén         256
Tucumán         253
Salta           253
Buenos Aires    245
Chubut          244
Mendoza         237
Santa Fe        235
Name: count, dtype: int64

 ¿Cuál es el producto principal más común entre los clientes?

In [95]:
producto_mas_comun = clientes['Producto_principal'].value_counts()
print(producto_mas_comun)

Producto_principal
Cuenta corriente      437
Caja de ahorro        407
Plazo fijo            404
Tarjeta de crédito    382
Préstamo personal     372
Name: count, dtype: int64

¿Cómo se distribuyen los productos principales por provincia?

In [102]:
productos_por_provincia =clientes.groupby(['Provincia', 'Producto_principal']).size().unstack(fill_value=0) ##el size cuenta filas por cada grupo, el unstack convierte el resultado en un DataFrame pivotea la tabla
print(productos_por_provincia)

Producto_principal  Caja de ahorro  Cuenta corriente  Plazo fijo  \
Provincia
Buenos Aires                    51                56          47
Chubut                          49                56          51
Córdoba                         67                58          54
Mendoza                         45                52          45
Neuquén                         50                52          47
Salta                           57                57          54
Santa Fe                        43                54          39
Tucumán                         45                52          67

Producto_principal  Préstamo personal  Tarjeta de crédito
Provincia
Buenos Aires                       47                  44
Chubut                             40                  48
Córdoba                            44                  56
Mendoza                            46                  49
Neuquén                            56                  51
Salta                              36                  49
Santa Fe                           54                  45
Tucumán                            49                  40

In [103]:
type(productos_por_provincia)

pandas.core.frame.DataFrame

In [104]:
productos_por_provincia.head()

Producto_principal,Caja de ahorro,Cuenta corriente,Plazo fijo,Préstamo personal,Tarjeta de crédito
Provincia,,,,,
Buenos Aires,51,56,47,47,44
Chubut,49,56,51,40,48
Córdoba,67,58,54,44,56
Mendoza,45,52,45,46,49
Neuquén,50,52,47,56,51

¿Cuáles son los clientes más antiguos en el banco?

In [97]:
clientes['Fecha_alta'] = pd.to_datetime(clientes['Fecha_alta']) ### convertimos el tipo de dato de object a datetime
clientes_antiguos = clientes.sort_values('Fecha_alta').head(10)
print(clientes_antiguos[['ID_cliente', 'Nombre','Apellido', 'Fecha_alta']])

      ID_cliente  Nombre  Apellido Fecha_alta
922          921   Pedro      Díaz 2015-01-01
686          685   Marta  Martínez 2015-01-01
63            62   Sofía     López 2015-01-02
314          313    Luis   Sánchez 2015-01-07
1170        1169    Juan     Gómez 2015-01-08
105          104   Diego    García 2015-01-08
1804        1803   Sofía    Romero 2015-01-09
798          797  Carlos   Sánchez 2015-01-13
832          831    Luis     Pérez 2015-01-16
1070        1069    Juan  Martínez 2015-01-18

In [53]:
clientes['Fecha_alta'].max()

Timestamp('2023-03-19 00:00:00')

In [54]:
antiguo = clientes[clientes['Fecha_alta'] == clientes['Fecha_alta'].min()]
antiguo

,ID_cliente,Nombre,Apellido,Edad,Provincia,Ocupacion,Saldo_cuenta,Limite_credito,Tiene_tarjeta,Producto_principal,Fecha_alta,Nivel_satisfaccion,Nombre_Completo
686,685,Marta,Martínez,77,Tucumán,Empresario,109931.93,12968.19,False,Cuenta corriente,2015-01-01,9.0,Marta Martínez
922,921,Pedro,Díaz,67,Tucumán,Empresario,77251.48,172590.37,True,Tarjeta de crédito,2015-01-01,0.0,Pedro Díaz

¿Cuál es el promedio de satisfacción por ocupación?

In [100]:
satisfaccion_ocupacion = clientes.groupby('Ocupacion')['Nivel_satisfaccion'].mean().sort_values(ascending=False)
satisfaccion_ocupacion

Ocupacion
Desempleado    5.014006
0              4.970000
Jubilado       4.947826
Estudiante     4.843478
Empresario     4.841432
Empleado       4.747253
Name: Nivel_satisfaccion, dtype: float64

In [101]:
type(satisfaccion_ocupacion)

pandas.core.series.Series

¿Qué porcentaje de clientes tiene tarjeta de crédito?

In [56]:
porcentaje_tarjeta =clientes['Tiene_tarjeta'].mean() * 100
print(f"El {porcentaje_tarjeta:.2f}% de los clientes tiene tarjeta de crédito.")

El 51.20% de los clientes tiene tarjeta de crédito.

¿Cuántos clientes tienen tarjeta y cuántos no?

In [57]:
tarjeta_counts = clientes['Tiene_tarjeta'].value_counts()
print(tarjeta_counts)

# Si querés verlo más claro:
print(f"\nClientes con tarjeta: {tarjeta_counts[True]}")
print(f"Clientes sin tarjeta: {tarjeta_counts[False]}")

Tiene_tarjeta
True     1024
False     976
Name: count, dtype: int64

Clientes con tarjeta: 1024
Clientes sin tarjeta: 976

Ejercicio: Bajar datos en el formato que prefieran y realizar un analisis exploratorio basico inicial como el realizado en clase

### concat y append

In [ ]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                    'B': ['B0', 'B1', 'B2', 'B3'],
                    'C': ['C0', 'C1', 'C2', 'C3'],
                    'D': ['D0', 'D1', 'D2', 'D3']},
                    index=[0, 1, 2, 3])
   

df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                    'B': ['B4', 'B5', 'B6', 'B7'],
                    'C': ['C4', 'C5', 'C6', 'C7'],
                    'D': ['D4', 'D5', 'D6', 'D7']},
                    index=[4, 5, 6, 7])


df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                    'B': ['B8', 'B9', 'B10', 'B11'],
                    'C': ['C8', 'C9', 'C10', 'C11']},
                    index=[8, 9, 10, 11])

frames = [df1, df2, df3]

In [ ]:
df3

      A    B    C
8    A8   B8   C8
9    A9   B9   C9
10  A10  B10  C10
11  A11  B11  C11

In [ ]:
pd.concat(frames)

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8  NaN
9    A9   B9   C9  NaN
10  A10  B10  C10  NaN
11  A11  B11  C11  NaN

### Merge
* merge(): el más completo y flexible
Funciona como el JOIN en SQL.

Permite combinar DataFrames por una o más columnas clave (pueden tener distinto nombre en cada DataFrame).

Permite especificar el tipo de join: 'inner', 'left', 'right', 'outer'.

In [ ]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                    'A': ['A0', 'A1', 'A2', 'A3'],
                    'B': ['B0', 'B1', 'B2', 'B3']})


right = pd.DataFrame({'key': ['K0', 'K1', 'K2'],
                    'C': ['C0', 'C1', 'C2'],
                    'D': ['D0', 'D1', 'D2']})


pd.merge(left, right, how='inner', on='key') #fx

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2

In [ ]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [ ]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2

### Join

In [ ]:
# Crear dos DataFrames de ejemplo
df_left = pd.DataFrame({
    'A': ['A0', 'A1', 'A2'],
    'B': ['B0', 'B1', 'B2']
}, index=['K0', 'K1', 'K2'])

df_right = pd.DataFrame({
    'C': ['C0', 'C1', 'C2'],
    'D': ['D0', 'D1', 'D2']
}, index=['K0', 'K2', 'K3'])

# Realizar el join
result = df_left.join(df_right, how='inner') #metodo
print(result)

     A   B   C   D
K0  A0  B0  C0  D0
K2  A2  B2  C1  D1

In [ ]:
df_left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [ ]:
df_right

     C   D
K0  C0  D0
K2  C1  D1
K3  C2  D2